{
    "navbar": {
        "welcome": "Willkommen",
        "plural": "Mehrzahl",
        "time": "Zeit",
        "german": "Deutsch",
        "english": "Englisch"
    },
    "home": {
        "title": "Einführung in die Internationalisierung",
        "subtitle": "Internationalisierung (Softwareentwicklung)",
        "content1": "Internationalisierung bedeutet in der Informatik beziehungsweise in der Softwareentwicklung, ein Programm so zu gestalten, dass es leicht (ohne den Quellcode ändern zu müssen) an andere Sprachen und Kulturen angepasst werden kann.",
        "content2": "Internationalisierung (englisch internationalization oder internationalisation) wird gerne mit dem Numeronym i18n abgekürzt (im englischen Wort Internationalization befinden sich 18 Buchstaben zwischen dem ersten Buchstaben I und dem letzten Buchstaben n).",
        "content3": "Hierunter fallen diejenigen Aufgaben, die der Entwickler/Programmierer eines Programms bewältigen muss. Dazu darf er zum Beispiel Beschreibungstexte nicht im Quellcode fest kodieren, sondern muss Variablen benutzen, die von einer Quelle zur Laufzeit eingelesen werden. Aber auch Datumsformatierungen und die sprachabhängige Oberflächengestaltung (z. B. kann Text unterschiedlich lang sein oder die Rechts-Nach-Links-Orientierung kann sich unterscheiden) gehören hierzu."
    },
    "plural": {
        "bread": "Brote | Brot | Brote",
        "cheese": "Käse | Käse | Käse",
        "oranges": "Orangen | Orange | Orangen",
        "sausages": "Würste | Wurst | Würste",
        "car": "Autos | Auto | Autos",
        "tree": "Bäume | Baum | Bäume"
    },
    "footer": {
        "imprint": "Impressum"
    },
    "imprint": {
        "title": "Impressum",
        "author": "Urheber",
        "authorName": "Benedikt Hauser",
        "description": "Beschreibung",
        "content": "Diese Website wurde im Zuge meiner Bachelorarbeit angelegt, um die Internationalisierung von Webseiten zu demonstrieren. Die Inhalte sind frei erfunden und dienen nur zu Demonstrationszwecken. Etwaige Übersetzungsfehler sind zu entschuldigen.",
        "address": "Adress: Musterstraße 123, 12345 Musterstadt",
        "contact": "Kontakt",
        "phone": "Telephon: 0123 456789",
        "email": "E-Mail: max@musterperson.at"
    }
}